src/cf/src/InformationRegisters/ТелеграмСобеседники/ТелеграмСобеседники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмСобеседники</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СчетчикПринятыхСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>first_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>last_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>username</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПозволятьОбщение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Бот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЧата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ТелеграмСобеседники/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗапомнитьСобеседника(Сообщение, ДанныеБота, ПозволитьДальнейшееОбщение) Экспорт
	
	Чат 				= Сообщение.chat;
	КоллекцияСвойств 	= Чат.Свойства();
	
	МЗ = РегистрыСведений.ТелеграмСобеседники.СоздатьМенеджерЗаписи();
	МЗ.Бот = ДанныеБота.Бот;
	МЗ.ИдентификаторЧата = Чат.id;
	МЗ.Прочитать();
	
	Если МЗ.Выбран() Тогда
		СчетчикПринятыхСообщений = МЗ.СчетчикПринятыхСообщений + 1;
		ПозволятьОбщение = МЗ.ПозволятьОбщение;
	Иначе
		СчетчикПринятыхСообщений = 1;
		ПозволятьОбщение = Ложь; 
	КонецЕсли;
	
	МЗ.Бот = ДанныеБота.Бот;
	МЗ.ИдентификаторЧата = Чат.id;
	
	Если КоллекцияСвойств.Получить("first_name") <> Неопределено Тогда
		МЗ.first_name = Чат.first_name;
	КонецЕсли;
	
	Если КоллекцияСвойств.Получить("last_name") <> Неопределено Тогда
		МЗ.last_name = Чат.last_name;
	КонецЕсли;
	
	Если КоллекцияСвойств.Получить("username") <> Неопределено Тогда
		МЗ.username = Чат.username;
	КонецЕсли;
	
	МЗ.Дата = ТекущаяДата();
	МЗ.СчетчикПринятыхСообщений = СчетчикПринятыхСообщений;
	МЗ.ПозволятьОбщение = ПозволятьОбщение;
	МЗ.Записать();
	
	ПозволитьДальнейшееОбщение = ПозволятьОбщение;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
